# StructuralAsset Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralAsset Class
Members See Also
---
Represents the properties of a material pertinent to structural analysis.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class StructuralAsset : IDisposable
```

Visual Basic
---
```text
Public Class StructuralAsset _
	Implements IDisposable
```

Visual C++
---
```text
public ref class StructuralAsset : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..StructuralAsset
# See Also
StructuralAsset Members
Autodesk.Revit.DB Namespace